# Type Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternSegment..::..Type Property
LinePatternSegment Class See Also
---
Gets and sets the type of the segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LinePatternSegmentType Type { get; set; }
```

Visual Basic
---
```text
Public Property Type As LinePatternSegmentType
	Get
	Set
```

Visual C++
---
```text
public:
property LinePatternSegmentType Type {
	LinePatternSegmentType get ();
	void set (LinePatternSegmentType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
LinePatternSegment Class
Autodesk.Revit.DB Namespace